### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [3]:
# number of unique players in the SN column
unique_players = purchase_data['SN'].nunique()

# creating a dataframe for total players
count_players = [{"Total Players": (unique_players)}]

count_players_df = pd.DataFrame(count_players)
count_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
number_of_unique_items = purchase_data["Item ID"].nunique()
number_of_unique_items

183

In [5]:
average_price = purchase_data["Price"].mean()

# clean average_price to only two decimal places
average_price_cleaned = format(average_price, ",.2f")
average_price_cleaned

'3.05'

In [6]:
number_of_purchases = purchase_data["Item ID"].count()
number_of_purchases

780

In [7]:
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [8]:
# return desired entries for purchasing analysis
purchasing_analysis = [{"Total Revenue": f"${total_revenue}", "Number of Purchases": (number_of_purchases), \
                        "Average Price": f"${average_price_cleaned}", "Number of Unique Items": (number_of_unique_items)}]

df_purchasing_analysis = pd.DataFrame(purchasing_analysis)
df_purchasing_analysis

  Average Price  Number of Purchases  Number of Unique Items Total Revenue
0         $3.05                  780                     183      $2379.77

In [9]:
# Reorganizing the columns using double brackets
df_purchasing_analysis_correct = df_purchasing_analysis[["Number of Unique Items","Average Price","Number of Purchases", \
                                                         "Total Revenue"]]
df_purchasing_analysis_correct

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
# locate the # of duplicate screen names in purchase_data
purchase_data["SN"].duplicated().sum()

204

In [11]:
# drop duplicate SN and create a new data frame to calculate demographics
total_players_df = purchase_data.drop_duplicates(subset=["SN"])

In [12]:
# create a df for gender
gender_df = total_players_df.Gender

In [13]:
# gender count
gender_count = gender_df.value_counts()
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [14]:
# gender percent
# format (multiply by 100 and round to 2 decimals places, also added % symbol)
gender_percent = gender_df.value_counts(normalize=True).mul(100).round(2).astype(str) + '%'
gender_percent

Male                     84.03%
Female                   14.06%
Other / Non-Disclosed     1.91%
Name: Gender, dtype: object

In [15]:
# Combine everything back into a data frame
# Andrew or Patricia, I added the '%' sign because it looks better in the table
gender_demographics_df = pd.DataFrame({'Total Count': gender_count, 'Percentage of Players': gender_percent})
gender_demographics_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [16]:
# group purchase data by Gender
# this will create a groupby object
gender_group_df = purchase_data.groupby('Gender')
gender_group_df

In [17]:
# count by gender group
gender_group_df_count = gender_group_df.count()[["Purchase ID"]]
# rename count by gender group df
gender_group_df_main = gender_group_df_count.rename(columns={"Purchase ID": "Purchase Count"})
gender_group_df_main

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [18]:
# average by gender group
gender_group_price = gender_group_df.mean()[["Price"]]
gender_group_price

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [19]:
# total purchase value by gender group
total_purchase_value = gender_group_df.sum()[["Price"]]
total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [20]:
# df for gender group analysis
gender_group_df_main["Average Purchase Price"] = gender_group_price
gender_group_df_main["Total Purchase Value"] = total_purchase_value
gender_group_df_main["Average Purchase Per Person"] = gender_group_df_main["Total Purchase Value"]/gender_demographics_df["Total Count"]
gender_group_df_main

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [21]:
# establish an age df
age_demographics = total_players_df
age_demographics.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [22]:
# establish bins for ages
bins = [0, 9, 14, 19, 24, 29, 34, 39, 200]

In [23]:
# establish the names for the bins
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [24]:
# adding Age Bins to main table
age_demographics["Age Bins"] = pd.cut(age_demographics["Age"], bins, labels=group_names)
age_demographics.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [25]:
# Group age_demographics by age
age_demographics_group = age_demographics.groupby("Age Bins")

In [26]:
# creating age_demographics series
age_demographics_group_series = age_demographics_group["Age"].count() 
age_demographics_group_series

Age Bins
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Age, dtype: int64

In [27]:
# changing age_demographics series into a df
age_demographics_df = pd.DataFrame({' ':age_demographics_group_series.index, \
                                    'Total Values':age_demographics_group_series.values})
age_demographics_df

          Total Values
0    <10            17
1  10-14            22
2  15-19           107
3  20-24           258
4  25-29            77
5  30-34            52
6  35-39            31
7    40+            12

In [28]:
age_demographics_df["Percentage of Players"] = (age_demographics_df['Total Values']/age_demographics_df['Total Values'] \
                                                .sum()).mul(100).round(2)
age_demographics_df

          Total Values  Percentage of Players
0    <10            17                   2.95
1  10-14            22                   3.82
2  15-19           107                  18.58
3  20-24           258                  44.79
4  25-29            77                  13.37
5  30-34            52                   9.03
6  35-39            31                   5.38
7    40+            12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [129]:
# establish a purchasing analysis df
purchasing_analysis = purchase_data
purchasing_analysis.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [130]:
# adding an Age Bins column
purchasing_analysis["Age Bins"] = pd.cut(purchasing_analysis["Age"], bins, labels=group_names)
purchasing_analysis.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [131]:
# grouping the df by Age Bins
purchasing_analysis_group = purchasing_analysis.groupby("Age Bins")
purchasing_analysis_group

In [132]:
# Count by price by age bracket
purchase_count_age = purchasing_analysis_group["Price"].count() 
purchase_count_age

Age Bins
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [133]:
# Average purchases by age
average_purchase_price_age = purchasing_analysis_group["Price"].mean()
average_purchase_price_age

Age Bins
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [134]:
# sum purchases by age
total_purchase_value = purchasing_analysis_group["Price"].sum()
total_purchase_value

Age Bins
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [135]:
# creating a new df
purchasing_analysis_df = purchasing_analysis.groupby("Age Bins").Price.agg(['count', 'mean', 'sum'])
purchasing_analysis_df

          count      mean      sum
Age Bins
<10          23  3.353478    77.13
10-14        28  2.956429    82.78
15-19       136  3.035956   412.89
20-24       365  3.052219  1114.06
25-29       101  2.900990   293.00
30-34        73  2.931507   214.00
35-39        41  3.601707   147.67
40+          13  2.941538    38.24

In [136]:
# cleaning purchases analysis df
purchasing_analysis_df_cleaned = purchasing_analysis_df.rename(columns={"count": "Purchase Count", \
                                                                       "mean": "Total Purchase Value", \
                                                                       "sum": "Total Purchase Value" })
purchasing_analysis_df_cleaned

          Purchase Count  Total Purchase Value  Total Purchase Value
Age Bins
<10                   23              3.353478                 77.13
10-14                 28              2.956429                 82.78
15-19                136              3.035956                412.89
20-24                365              3.052219               1114.06
25-29                101              2.900990                293.00
30-34                 73              2.931507                214.00
35-39                 41              3.601707                147.67
40+                   13              2.941538                 38.24

In [137]:
Avg_Total_Per_Person = total_purchase_value/ age_demographics_df["Total Values"]
Avg_Total_Per_Person

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
5       NaN
6       NaN
7       NaN
10-14   NaN
15-19   NaN
20-24   NaN
25-29   NaN
30-34   NaN
35-39   NaN
40+     NaN
<10     NaN
dtype: float64

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [159]:
# create a group for SN and aggragate
SN_group = purchase_data.groupby("SN").Price.agg(['count', 'mean', 'sum'])
SN_group.head()

              count  mean   sum
SN
Adairialis76      1  2.28  2.28
Adastirin33       1  4.48  4.48
Aeda94            1  4.91  4.91
Aela59            1  4.32  4.32
Aelaria33         1  1.79  1.79

In [160]:
# create a seperate df for SN_group with renamed columns
SN_group_df = SN_group.rename(columns={"count": "Purchase Count", "mean": "Average Purchase Price", \
                                      "sum": "Total Purchase Value"})
SN_group_df.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [161]:
# sort dataframe by Total Purchase Value
SN_group_df_sorted = SN_group_df.sort_values("Total Purchase Value", ascending=False)
SN_group_df_sorted.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [178]:
# Retrieve the Item ID, Item Name, and Item Price
most_popular_items = purchase_data[["Item ID", "Item Name", "Price"]]
most_popular_items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [179]:
# create a most popular item group
popular_items_group = purchase_data.groupby(["Item ID", "Item Name"]).Price.agg(['count', 'mean', 'sum'])
popular_items_group.head()

                            count  mean    sum
Item ID Item Name
0       Splinter                4  1.28   5.12
1       Crucifer                3  3.26   9.78
2       Verdict                 6  2.48  14.88
3       Phantomlight            6  2.49  14.94
4       Bloodlord's Fetish      5  1.70   8.50

In [180]:
# rename my columns in the dataframe
popular_items_group_df = popular_items_group.rename(columns={"count": "Purchase Count", "mean": "Price", \
                                      "sum": "Total Purchase Value"})
popular_items_group_df.head()

                            Purchase Count  Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4   1.28                  5.12
1       Crucifer                         3   3.26                  9.78
2       Verdict                          6   2.48                 14.88
3       Phantomlight                     6   2.49                 14.94
4       Bloodlord's Fetish               5   1.70                  8.50

In [181]:
# sort and display a preview of the summary data fram
popular_items_group_sorted = popular_items_group_df.sort_values("Purchase Count", ascending=False)
popular_items_group_sorted.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [182]:
# sort and display a preview of the summary data fram
popular_items_group_sorted_PV = popular_items_group_df.sort_values("Total Purchase Value", ascending=False)
popular_items_group_sorted_PV.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80